# ── CLI tools ────────────────────────────────────────────────
brew "git"
brew "chezmoi"
brew "starship"
brew "zoxide"
brew "ripgrep"
brew "eza"
brew "bat"
brew "fnm"
brew "pyenv"
brew "direnv"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "yt-dlp"
brew "gh"
brew "railway"
brew "cocoapods"
brew "openjdk@21"
brew "jenv"
brew "gradle"

# ── Apps ─────────────────────────────────────────────────────
cask "claude-code"
cask "1password"
cask "google-chrome"
cask "firefox"
cask "spotify"
cask "iterm2"
cask "raycast"
cask "webstorm"
cask "docker-desktop"

# ── Mac App Store ────────────────────────────────────────────
brew "mas"
mas "Xcode", id: 497799835

# ── Fonts ────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"
